# run 'brew bundle' to install all listed packages

### Mac App Store CLI ###
brew "mas" # Mac App Store command-line interface

### Fonts ###
# cask "font-hack-nerd-font"
# cask "font-roboto-mono-nerd-font"
cask "font-commit-mono-nerd-font"

### Version managers ###
brew "mise" # Polyglot runtime manager (asdf rust clone)
# brew "nvm" # Manage multiple Node.js versions
# brew "pyenv" # Python version management
# brew "rbenv" # Ruby version manager

### Shell plugin ###
# brew "jandedobbeleer/oh-my-posh/oh-my-posh" # Prompt theme engine for any shell
brew "starship" # Cross-shell prompt for astronauts
brew "zoxide" # Shell extension to navigate your filesystem faster
brew "zsh-autosuggestions" # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-syntax-highlighting" # Fish shell like syntax highlighting for zsh
brew "zsh-vi-mode" # Better and friendly vi(vim) mode plugin for ZSH

### Compilers ###
brew "ghcup" # Installer for the general purpose language Haskell
brew "pkl" # CLI for the Pkl programming language
brew "rust" # Safe, concurrent, practical language

### Builder ###
brew "just" # Handy way to save and run project-specific commands
brew "make" # Utility for directing compilation
brew "mask" # CLI task runner defined by a simple markdown file
brew "parallel" # Shell command parallelization utility

### Editor ###
brew "neovim" # Ambitious Vim-fork focused on extensibility and agility
brew "tree-sitter-cli" # Parser generator tool
cask "zed" # Multiplayer code editor

### Version control ###
# cask "fork" # GIT client
# brew "gh" # GitHub command-line tool
brew "git" # Distributed revision control system
brew "git-delta" # Syntax-highlighting pager for git and diff output
brew "git-crypt" # Transparent file encryption in git
brew "git-lfs" # Git extension for versioning large files
brew "gitleaks" # Audit git repos for secrets
brew "gitui" # Blazing fast terminal-ui for git written in rust
cask "gitup-app" # Git interface focused on visual interaction
brew "hub" # Add GitHub support to git on the command-line
brew "jnsahaj/lumen/lumen", trusted: true # AI-powered CLI tool for git commit summaries
brew "lazygit" # Simple terminal UI for git commands
brew "serie" # Rich git commit graph in your terminal

### File/Memory management ###
brew "duf" # Disk Usage/Free Utility - a better 'df' alternative
brew "dust" # More intuitive version of du in rust
# brew "kondo" # Save disk space by cleaning non-essential files from software projects
brew "mole" # Deep clean and optimize your Mac
brew "superfile" # Modern and pretty fancy file manager for the terminal
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "yazi" # Blazing fast terminal file manager written in Rust, based on async I/O

### Process/System monitor ###
brew "bottom" # Yet another cross-platform graphical process/system monitor
brew "htop" # Improved top (interactive process viewer)
brew "hyperfine" # Command-line benchmarking tool

### VPN ###
# brew "openconnect" # Open client for Cisco AnyConnect VPN
# mas "Windows App", id: 1295203466

### Networking ###
brew "julien-cpsn/atac/atac", trusted: true # A simple API client (postman like) in your terminal
brew "curlie" # Power of curl, ease of use of httpie
brew "drill" # HTTP load testing application written in Rust
cask "hoppscotch" # Open source API development ecosystem
brew "hurl" # Run and Test HTTP Requests with plain text and curl
cask "mitmproxy" # Intercept, modify, replay, save HTTP/S traffic
# cask "proxyman" # Modern and intuitive HTTP Debugging Proxy app
brew "telnet" # User interface to the TELNET protocol
brew "xh" # Friendly and fast tool for sending HTTP requests

### Virtualization & Containers ###
# cask "balenaetcher" # Tool to flash OS images to SD cards & USB drives -> NOT M1 COMPATIBLE
# cask "citrix-workspace" if system(%q[mdfind "kMDItemCFBundleIdentifier == 'com.checkpoint.eps.gui'" | grep -q .]) # Managed desktop virtualization solution -> TODO: confirm Endpoint Security VPN bundle id (run: mdls -name kMDItemCFBundleIdentifier "/Applications/Endpoint Security VPN.app")
# brew "docker" # App to build and share containerized applications and microservices
brew "podman" # Tool for managing OCI containers and pods
cask "raspberry-pi-imager" # Imaging utility to install operating systems to a microSD card -> NOT M1 COMPATIBLE

### Image editing/manipulation ###
cask "drawio" # Draw.io is free online diagram software
cask "figma" # Collaborative team software
cask "gimp" # Free and open-source image editor -> NOT M1 COMPATIBLE
brew "imagemagick" # Tools and libraries to manipulate images in many formats
cask "imageoptim" # Tool to optimize images to a smaller size
# cask "inkscape" # Vector graphics editor
brew "viu" # Simple terminal image viewer written in Rust
# cask "zeplin" # Share, organize and collaborate on designs

### Compression ###
cask "keka" # File archiver

### Internet browser ###
# cask "brave-browser" # Web browser focusing on privacy
# Browserpass setup for Firefox:
# PREFIX='/opt/homebrew/opt/browserpass' make hosts-firefox-user -f '/opt/homebrew/opt/browserpass/lib/browserpass/Makefile'
# Browserpass setup for Helium:
# PREFIX='/opt/homebrew/opt/browserpass' make hosts-chromium-user -f '/opt/homebrew/opt/browserpass/lib/browserpass/Makefile'
brew "amar1729/homebrew-formulae/browserpass", trusted: true # Host application for browser extension providing access to your password store
mas "Consent-O-Matic", id: 1606897889
mas "DuckDuckGo", id: 663592361
# cask "firefox" # Web browser
cask "helium-browser" # Chromium-based web browser
mas "uBlock Origin Lite", id: 6745342698
cask "zen" # Gecko based web browser

### PDF inspection/manipulation ###
brew "ghostscript" # Interpreter for PostScript and PDF
cask "skim" # PDF reader and note-taking application

### Writing ###
cask "deepl" # Trains AIs to understand and translate texts
mas "LanguageTool", id: 1534275760

### Office tools ###
mas "Keynote", id: 361285480
# cask "libreoffice" # Office suite
cask "mactex" # Full TeX Live distribution with GUI applications
# mas "Microsoft Excel", id: 462058435
# mas "Microsoft Outlook", id: 985367838
# mas "Microsoft PowerPoint", id: 462062816
# mas "Microsoft Word", id: 462054704
mas "Numbers", id: 361304891
# mas "OneDrive", id: 823766827
mas "Pages", id: 361309726
brew "presenterm" # Terminal slideshow tool
brew "typst" # Markup-based typesetting system
# cask "zotero" # Collect, organize, cite, and share research sources -> NOT M1 COMPATIBLE

### Keyboard Tools ###
brew "gnu-typist" # GNU typing tutor
cask "keyboardcleantool" # Blocks all Keyboard and TouchBar input
mas "Keymapp", id: 6472865291 # ZSA keyboard firmware flasher
brew "toipe" # Yet another typing test, but crab flavoured
brew "zapp" # Flash ZSA keyboards from your terminal

### User manual ###
brew "cheat" # Create and view interactive cheat sheets for *nix commands

### File inspection ###
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
#cask "exifcleaner" # Metadata cleaner -> NOT M1 COMPATIBLE
brew "eza" # Modern, maintained replacement for ls
brew "fx" # Terminal JSON viewer
brew "glow" # Render markdown on the CLI
brew "hexyl" # Command-line hex viewer
brew "jq" # Lightweight and flexible command-line JSON processor
brew "jql" # JSON query language CLI tool
brew "qpdf" # Tools for and transforming and inspecting PDF files
brew "leaf-md" # Terminal Markdown previewer with a GUI-like experience
brew "tabiew" # TUI to view and query tabular files (CSV,TSV, Parquet, etc.)
brew "tesseract" # OCR (Optical Character Recognition) engine
brew "tesseract-lang" # Enables extra languages support for Tesseract
brew "tokei" # Program that allows you to count code, quickly
brew "xq" # Command-line XML and HTML beautifier and content extractor
brew "yq" # Process YAML, JSON, XML, CSV and properties documents from the CLI

### File and content search ###
brew "fd" # Simple, fast and user-friendly alternative to find
brew "fzf" # Command-line fuzzy finder written in Go
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "ripgrep-all" # Wrapper around ripgrep that adds multiple rich file types
brew "sd" # Intuitive find & replace CLI
brew "sk" # Fuzzy Finder in rust!
brew "television" # General purpose fuzzy finder TUI

### Terminal ###
# cask "alacritty" # GPU-accelerated terminal emulator
brew "cmatrix" # Console Matrix
cask "ghostty" # Terminal emulator that uses platform-native UI and GPU acceleration
brew "herdr" # Agent multiplexer that lives in your terminal
# brew "zellij" # Pluggable terminal workspace, with terminal multiplexer as the base feature

### Time management ###
# mas "Be Focused", id: 973134470
# cask "michaelvillar-timer" # Timer application

### Password management ###
# cask "1password" # Password manager that keeps all passwords secure behind one password
mas "Bitwarden", id: 1352778147 # Desktop password and login vault
brew "gnupg" # GNU Privacy Guard (OpenPGP)
brew "pass" # Password manager
brew "pinentry-mac" # Pinentry for GPG on Mac
# cask "macpass" # Open-source, KeePass-client and password manager
cask "secretive" # Store SSH keys in the Secure Enclave

### Database ###
# cask "dbeaver-community" # Universal database tool and SQL client
cask "pgadmin4" # Administration and development platform for PostgreSQL
brew "postgresql@17" # Object-relational database system
brew "rainfrog" # Database management TUI for Postgres

### Note taking ###
# cask "notion" # App to write, plan, collaborate, and get organized
cask "obsidian" # Knowledge base that works on top of a local folder of plain text Markdown files
# sudo ln -sf /Applications/Obsidian.app/Contents/MacOS/obsdidian-cli /usr/local/bin/obsidian
mas "reMarkable", id: 1276493162 # View, Screen Share, organize, import, and download files to a reMarkable device

### Windows management ###
# cask "nikitabobko/tap/aerospace", trusted: true # AeroSpace is an i3-like tiling window manager for macOS
cask "amethyst" # Automatic tiling window manager similar to xmonad
# cask "flashspace" # Virtual workspace manager
# cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
# brew "yabai" # A tiling window manager for macOS based on binary space partitioning

### macOS utilities ###
cask "blackhole-2ch" # Virtual Audio Driver
brew "defaultbrowser" # Command-line tool for getting & setting the default browser
# cask "hammerspoon" # Desktop automation application
# cask "leader-key" # Application launcher
cask "maccy" # Clipboard manager
cask "monitorcontrol" # Tool to control external monitor brightness & volume
cask "notunes" # Simple application that will prevent iTunes or Apple Music from launching
# noTunes Setup: defaults write digital.twisted.noTunes replacement /Applications/Spotify.app
# cask "qlmarkdown" # QuickLook generator for Markdown files
cask "shortcat" # App that enables mouse-free UI interaction
# brew "skhd" # Simple hotkey-daemon for macOS

### Learning ###
cask "anki" # Memory training application

### Cloud storage ###
#cask "google-drive" # Client for the Google Drive storage service
mas "OX Drive", id: 818195014 # Cloud client
cask "syncthing-app" # Real time file synchronization software

### Messaging/Video call ###
# cask "microsoft-teams" # Meet, chat, call, and collaborate in just one place
# cask "mumble" # Open-source, low-latency, high quality voice chat software for gaming
cask "signal" # Instant messaging application focusing on security
mas "Slack", id: 803453959 # Team communication and collaboration software
cask "studiolinkstandalone" # SIP application to create high quality Audio over IP (AoIP) connections
cask "telegram" # Messaging app with a focus on speed and security
mas "WhatsApp", id: 310633997
cask "zoom" # Video communication and virtual meeting platform

### Video creation/playback ###
brew "ffmpeg" # Play, record, convert, and stream audio and video
mas "Gifski", id: 1351639930
cask "handbrake-app" # Open-source video transcoder
mas "iMovie", id: 408981434
cask "shotcut" # Video editor
cask "vlc" # Multimedia player

### Music creation/playback ###
# mas "GarageBand", id: 682658836
cask "sonos" # Control your Sonos system
cask "spotify" # Music streaming service
brew "spotify_player" # Command driven spotify player

### Android development ###
brew "detekt" # Static code analysis for Kotlin
cask "jetbrains-toolbox" # JetBrains tools manager
brew "kdoctor" # Environment diagnostics for Kotlin Multiplatform Mobile app development -> Kotlin Multiplatform

### Large language model ###
brew "apfel" # Apple Intelligence from the command-line, with OpenAi-compatible API server
# cask "claude-code" # Terminal-based AI coding assistant
# cask "copilot-cli" # Brings the power of Copilot coding agent directly to your terminal
brew "fabric-ai" # Open-source framework for augmenting humans using AI
brew "anomalyco/tap/opencode", trusted: true # AI coding agent, built for the terminal
brew "pi-coding-agent" # AI agent toolkit

### iOS development ###
mas "Apple Configurator", id: 1037126344
brew "dependency-check" # OWASP dependency-check
# mas "Dev Jobs", id: 1578276279
mas "Developer", id: 640199958 # Apple Developer
# brew "licenseplist" # License list generator of all your dependencies for iOS applications
brew "lizard-analyzer" # Extensible Cyclomatic Complexity Analyzer
# brew "mint" # Dependency manager that installs and runs Swift command-line tool packages
cask "sf-symbols" # Tool that provides consistent, highly configurable symbols for apps
# cask "swiftybeaver" # Access your app logs in development & release with end-to-end encryption -> NOT M1 COMPATIBLE
# brew "swiftenv" # Swift version manager
brew "swiftly" # Swift toolchain installer and manager
brew "swift-protobuf" # Plugin and runtime library for using protobuf with Swift
mas "TestFlight", id: 899247664
# mas "Xcode", id: 497799835 # <- Xcode being installed using xcodes
brew "xcode-kotlin" # Kotlin Native Xcode Plugin
brew "xcodesorg/made/xcodes", trusted: true # Best command-line tool to install and switch between multiple versions of Xcode
# cask "xcodesorg/made/xcodes", trusted: true # Install and switch between multiple versions of Xcode -> App version of xcodes command-line tool
brew "vapor" if system(%q[mdfind "kMDItemCFBundleIdentifier == 'com.apple.dt.Xcode'" | grep -q .]) # Command-line tool for Vapor (Server-side Swift web framework) -> requires Xcode

### Machine learning ###
brew "mlx" # Array framework for Apple silicon
